Ext.define('YourTour.store.RouteStore', {
    extend: 'Ext.data.Store',
    requires: [
       'YourTour.model.RouteModel'
    ],
    config:{
    	model:'YourTour.model.RouteModel',
    	autoLoad:false,
    	
    	data:[
    		{rowKey:"1",imageUrl:"resources/images/guangdong.jpg", name:"九寨沟、黄龙、峨眉、乐山双飞7日",lineName:"九寨沟、黄龙、峨眉、乐山", feeling:"旅行并不仅仅是你到了一个景点，在那儿拍照留念，当时的天气，当时空气中花粉的味道，还有当时你是否是气喘吁吁汗流浃背，这些都构成了你旅行的一部分，你整个的身体是在参与的，而不仅仅是拍照和看到",startTime:"2016-01-01", endTime:"2016-01-10", period:"10"},
	        {rowKey:"2",imageUrl:"resources/images/beijing.jpg", name:"九寨沟、黄龙、峨眉、乐山双飞7日",lineName:"九寨沟、黄龙、峨眉、乐山", feeling:"旅游，是人们多么喜欢的字眼，它可以使你中断每天周而复始的凡人琐事，对平凡俗气的生活，是一种暂时的解脱。旅游观光，领略山山水水，感受每一处的风土人情，不仅陶冶情操，增长见闻，还能修身养性，解悟释惑。正是：“离家三里远，别是一乡风”。只有走出去，才能享受大自然的乐趣，使自己的胸怀得以舒展，心灵得以净化！旅游，是人们多么喜欢的字眼，它可以使你中断每天周而复始的凡人琐事，对平凡俗气的生活，是一种暂时的解脱。旅游观光，领略山山水水，感受每一处的风土人情，不仅陶冶情操，增长见闻，还能修身养性，解悟释惑。正是：“离家三里远，别是一乡风”。只有走出去，才能享受大自然的乐趣，使自己的胸怀得以舒展，心灵得以净化！",startTime:"2016-01-01", endTime:"2016-01-10", period:"10"},
	        {rowKey:"3",imageUrl:"resources/images/chongqing.jpg", name:"九寨沟、黄龙、峨眉、乐山双飞7日",lineName:"九寨沟、黄龙、峨眉、乐山", feeling:"旅游，是人们多么喜欢的字眼，它可以使你中断每天周而复始的凡人琐事，对平凡俗气的生活，是一种暂时的解脱。旅游观光，领略山山水水，感受每一处的风土人情，不仅陶冶情操，增长见闻，还能修身养性，解悟释惑。正是：“离家三里远，别是一乡风”。只有走出去，才能享受大自然的乐趣，使自己的胸怀得以舒展，心灵得以净化！旅游，是人们多么喜欢的字眼，它可以使你中断每天周而复始的凡人琐事，对平凡俗气的生活，是一种暂时的解脱。旅游观光，领略山山水水，感受每一处的风土人情，不仅陶冶情操，增长见闻，还能修身养性，解悟释惑。正是：“离家三里远，别是一乡风”。只有走出去，才能享受大自然的乐趣，使自己的胸怀得以舒展，心灵得以净化！",startTime:"2016-01-01", endTime:"2016-01-10", period:"10"},
	        {rowKey:"4",imageUrl:"resources/images/yunnan.jpg", name:"九寨沟、黄龙、峨眉、乐山双飞7日",lineName:"九寨沟、黄龙、峨眉、乐山", feeling:"旅游，是人们多么喜欢的字眼，它可以使你中断每天周而复始的凡人琐事，对平凡俗气的生活，是一种暂时的解脱。旅游观光，领略山山水水，感受每一处的风土人情，不仅陶冶情操，增长见闻，还能修身养性，解悟释惑。正是：“离家三里远，别是一乡风”。只有走出去，才能享受大自然的乐趣，使自己的胸怀得以舒展，心灵得以净化！旅游，是人们多么喜欢的字眼，它可以使你中断每天周而复始的凡人琐事，对平凡俗气的生活，是一种暂时的解脱。旅游观光，领略山山水水，感受每一处的风土人情，不仅陶冶情操，增长见闻，还能修身养性，解悟释惑。正是：“离家三里远，别是一乡风”。只有走出去，才能享受大自然的乐趣，使自己的胸怀得以舒展，心灵得以净化！",startTime:"2016-01-01", endTime:"2016-01-10", period:"10"},
	        {rowKey:"5",imageUrl:"resources/images/shanghai.jpg", name:"九寨沟、黄龙、峨眉、乐山双飞7日",lineName:"九寨沟、黄龙、峨眉、乐山", feeling:"旅游，是人们多么喜欢的字眼，它可以使你中断每天周而复始的凡人琐事，对平凡俗气的生活，是一种暂时的解脱。旅游观光，领略山山水水，感受每一处的风土人情，不仅陶冶情操，增长见闻，还能修身养性，解悟释惑。正是：“离家三里远，别是一乡风”。只有走出去，才能享受大自然的乐趣，使自己的胸怀得以舒展，心灵得以净化！旅游，是人们多么喜欢的字眼，它可以使你中断每天周而复始的凡人琐事，对平凡俗气的生活，是一种暂时的解脱。旅游观光，领略山山水水，感受每一处的风土人情，不仅陶冶情操，增长见闻，还能修身养性，解悟释惑。正是：“离家三里远，别是一乡风”。只有走出去，才能享受大自然的乐趣，使自己的胸怀得以舒展，心灵得以净化！",startTime:"2016-01-01", endTime:"2016-01-10", period:"10"}
    	]
    	/*proxy:{
	    	api:{
				 read: YourTour.util.Context.getContext('/route/user/Query.action'),
				 create: YourTour.util.Context.getContext('/route/Save.action'),
				 update: YourTour.util.Context.getContext('/route/Update.action'),
				 destroy: YourTour.util.Context.getContext('/route/Delete.action')
			}
    	}*/
    },
});
